app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "films".* FROM "films"
---
  def show
  	@category = Category.find(params[:id])
  	@films = Film.select {|film| film.category_id == @category.id}