app/controllers/films_controller.rb

SELECT "films".* FROM "films"
---
  def index
    @films = Film.all

SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show
    @film = Film.find(params[:id])